# # 1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
# # Пример: Для N = 5: 1, -3, 9, -27, 81

# Number = int(input('Введите число N : '))
# result = []
# for degree in range(Number):
#     result.append(str((-3) ** degree))
# print(" , ".join(result), end=".")

# Для натурального n создать словарь индекс-значение, состоящий из элементов последовательности 3n + 1.
# Пример: Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

# lst = [i for i in range(-5, 6)]
# print(len(lst))



# int(input('Введите число '))

